InformationRegisters/КоличествоЗаписейРегистраторовРасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>КоличествоЗаписейРегистраторовРасчетов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоличествоЗаписей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>АналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяТаблицы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РегистраторРасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КоличествоЗаписейРегистраторовРасчетов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполнение регистра сведений "Количество записей регистраторов расчетов" по данным движений 
// служебного документа - регистратора.
// 
// Параметры:
//  ДокументРегистратор - ДокументСсылка - Регистратор
//  ИмяРегистра - Строка - Имя регистра расчета
Процедура ОтразитьКоличествоЗаписейРегистраторовРасчетов(ДокументРегистратор, ИмяРегистра) Экспорт

	Если Не ТипЗнч(ДокументРегистратор) = Тип("ДокументСсылка.РегистраторРасчетов") Тогда
		Возврат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	РегистрРасчета.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РегистрРасчета.ОбъектРасчетов КАК ОбъектРасчетов,
	|	РегистрРасчета.Валюта КАК Валюта,
	|	НАЧАЛОПЕРИОДА(РегистрРасчета.Период, ДЕНЬ) КАК ПериодЗаписи,
	|	РегистрРасчета.Регистратор КАК Документ,
	|	СУММА(1) КАК КоличествоЗаписей
	|ИЗ
	|	&ИмяТаблицы КАК РегистрРасчета
	|ГДЕ
	|	РегистрРасчета.Регистратор = &Регистратор
	|СГРУППИРОВАТЬ ПО
	|	РегистрРасчета.АналитикаУчетаПоПартнерам,
	|	РегистрРасчета.ОбъектРасчетов,
	|	РегистрРасчета.Валюта,
	|	РегистрРасчета.Регистратор,
	|	НАЧАЛОПЕРИОДА(РегистрРасчета.Период, ДЕНЬ)";

	Запрос.УстановитьПараметр("Регистратор", ДокументРегистратор);

	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяТаблицы", "РегистрНакопления." + ИмяРегистра);

	Выборка = Запрос.Выполнить().Выбрать();

	НаборЗаписей = РегистрыСведений.КоличествоЗаписейРегистраторовРасчетов.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(ДокументРегистратор);
	НаборЗаписей.Отбор.ИмяТаблицы.Установить(ИмяРегистра);

	Пока Выборка.Следующий() Цикл
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		Запись.ИмяТаблицы = ИмяРегистра;
	КонецЦикла;

	НаборЗаписей.Записать();

КонецПроцедуры

#КонецОбласти

#КонецЕсли
